# ---------------------- УПРК ----------------------
vip = ['36']
premium = ['2','3','4']
amex = ['5','6','7']
vip_pos = ['8','64']
pos = ['17','18','19']
minipos = ['37','38','39']
hm = ['40']
cards = ['11','12','13','112'] # 112 - Card_Line_2
card_of_block = ['78'] # блокировка карт по звонкам из одтелений

main_cards = []
for value in [vip, premium, amex, vip_pos, pos, minipos, hm, cards, card_of_block]:
    for split in value:
        main_cards.append(split)
# --------------------------------------------------
cards_cba = ['10']
# ---------------------- УПИБ ----------------------
homebank = ['14','15','16']
payments = ['30','31','32']

main_homebank = []
for value in [homebank, payments]:
    for split in value:
        main_homebank.append(split)
# --------------------------------------------------
homebank_cba = ['62']
# --------------------------------------------------
onlinebank = ['26','27','28']
vip_onlinebank = ['65','66']

main_onlinebank = []
for value in [onlinebank, vip_onlinebank]:
    for split in value:
        main_onlinebank.append(split)
# ---------------------- РУБС ----------------------
retail = ['20','21','22','111'] # 111 -  Retail_Line_2
# --------------------------------------------------
retail_cba = ['29']
# ---------------------- ИКЦ ----------------------
sales = ['33','34','35']
# ----------------- Soft -------------------
soft = ['42','43']
# --------------------------------------------------
posobie = ['114','115']
# --------------------------------------------------
posobie_cba = ['121']
# --------------------------------------------------
otdelenyaATM = ['116','117']
# --------------------------------------------------
onboarding = ['118','119'] 
# --------------------------------------------------
tranOutsourcing = ['201']
# --------------------------------------------------
# cardsLine = ['112']
# --------------------------------------------------
# retailLine = ['111']
# --------------------------------------------------
pension = ['122','123']